RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/flash/fsl_flash_ffr.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */

#ifndef _FSL_FLASH_FFR_H_
#define _FSL_FLASH_FFR_H_

#include "fsl_flash.h"

/*!
 * @addtogroup flash_ffr_driver
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Alignment(down) utility. */
#if !defined(ALIGN_DOWN)
#define ALIGN_DOWN(x, a) ((x) & (uint32_t)(-((int32_t)(a))))
#endif

/*! @brief Alignment(up) utility. */
#if !defined(ALIGN_UP)
#define ALIGN_UP(x, a) (-((int32_t)((uint32_t)(-((int32_t)(x))) & (uint32_t)(-((int32_t)(a))))))
#endif

#define FLASH_FFR_MAX_PAGE_SIZE (512U)
#define FLASH_FFR_HASH_DIGEST_SIZE (32U)
#define FLASH_FFR_IV_CODE_SIZE (52U)

enum flash_ffr_page_offset
{
    kFfrPageOffset_CFPA = 0U,         /*!< Customer In-Field programmed area*/
    kFfrPageOffset_CFPA_Scratch = 0U, /*!< CFPA Scratch page */
    kFfrPageOffset_CFPA_CfgPing = 1U, /*!< CFPA Configuration area (Ping page)*/
    kFfrPageOffset_CFPA_CfgPong = 2U, /*!< Same as CFPA page (Pong page)*/

#if defined(LPC55S36_SERIES)
    kFfrPageOffset_CMPA = 3U,         /*!< Customer Manufacturing programmed area*/
    kFfrPageOffset_CMPA_Cfg = 3U,     /*!< CMPA Configuration area (Part of CMPA)*/
    kFfrPageOffset_CMPA_Csr_Key = 4U, /*!< Customer Key Store Area (Part of CMPA)*/

    kFfrPageOffset_NMPA_Key = 5U,     /*!< Key Store area (Part of NMPA)*/
    kFfrPageOffset_NMPA = 5U,         /*!< NXP Manufacturing programmed area*/
    kFfrPageOffset_NMPA_Romcp = 8U,   /*!< ROM patch area (Part of NMPA)*/
    kFfrPageOffset_NMPA_Repair = 10U, /*!< Repair area (Part of NMPA)*/
    kFfrPageOffset_NMPA_Cfg = 16U,    /*!< NMPA configuration area (Part of NMPA)*/
    kFfrPageOffset_NMPA_End = 17U,    /*!< Reserved (Part of NMPA)*/
#else
    kFfrPageOffset_CMPA = 3U,     /*!< Customer Manufacturing programmed area*/
    kFfrPageOffset_CMPA_Cfg = 3U, /*!< CMPA Configuration area (Part of CMPA)*/
    kFfrPageOffset_CMPA_Key = 4U, /*!< Key Store area (Part of CMPA)*/

    kFfrPageOffset_NMPA = 7U,        /*!< NXP Manufacturing programmed area*/
    kFfrPageOffset_NMPA_Romcp = 7U,  /*!< ROM patch area (Part of NMPA)*/
    kFfrPageOffset_NMPA_Repair = 9U, /*!< Repair area (Part of NMPA)*/
    kFfrPageOffset_NMPA_Cfg = 15U,   /*!< NMPA configuration area (Part of NMPA)*/
    kFfrPageOffset_NMPA_End = 16U,   /*!< Reserved (Part of NMPA)*/
#endif

};

enum flash_ffr_page_num
{
    kFfrPageNum_CFPA = 3U, /*!< Customer In-Field programmed area*/
#if defined(LPC55S36_SERIES)
    kFfrPageNum_CMPA = 2U, /*!< Customer Manufacturing programmed area*/
#else
    kFfrPageNum_CMPA = 4U,           /*!< Customer Manufacturing programmed area*/
#endif
    kFfrPageNum_NMPA = 13U, /*!< NXP Manufacturing programmed area*/

    kFfrPageNum_CMPA_Cfg = 1U,
    kFfrPageNum_NMPA_Romcp = 2U,

    kFfrPageNum_SpecArea = kFfrPageNum_CFPA + kFfrPageNum_CMPA,
    kFfrPageNum_Total = (kFfrPageNum_CFPA + kFfrPageNum_CMPA + kFfrPageNum_NMPA),
};

enum flash_ffr_block_size
{
    kFfrBlockSize_Key = 52U,
#if defined(LPC55S36_SERIES)
    kFfrBlockSize_ActivationCode = 996U,
#else
    kFfrBlockSize_ActivationCode = 1192U,
#endif
};

enum cfpa_cfg_cmpa_prog_status
{
    kFfrCmpaProgStatus_Idle = 0x0U,
    kFfrCmpaProgStatus_InProgress = 0x5CC55AA5U,
};

typedef enum
{
    kFfrCmpaProgProcess_Pre = 0x0U,
    kFfrCmpaProgProcess_Post = 0xFFFFFFFFU,
} cmpa_prog_process_t;

typedef struct
{
    uint32_t header;             /*!< [0x000-0x003] */
    uint32_t version;            /*!< [0x004-0x007] */
    uint32_t secureFwVersion;    /*!< [0x008-0x00b] */
    uint32_t nsFwVersion;        /*!< [0x00c-0x00f] */
    uint32_t imageKeyRevoke;     /*!< [0x010-0x013] */
    uint32_t ivPrince[3];        /*!< [0x014-0x01f] */
    uint32_t ivIped[4];          /*!< [0x020-0x02f] */
    uint32_t custCtr[8];         /*!< [0x030-0x03f] */
    uint32_t rotkhRevoke;        /*!< [0x018-0x01b] */
    uint32_t vendorUsage;        /*!< [0x050-0x053] */
    uint32_t dcfgNsPin;          /*!< [0x058-0x05b] */
    uint32_t dcfgNsDflt;         /*!< [0x05c-0x05f] */
    uint32_t enableFaMode;       /*!< [0x060-0x063] */
    uint32_t cmpaProgInProgress; /*!< [0x064-0x067] */
    uint32_t imageCmacUpdateEn;  /*!< [0x068-0x06b] */
    uint32_t cfpaVersion;        /*!< [0x06c-0x06f] */
    uint32_t img0Cmac[4];        /*!< [0x070-0x07f] */
    uint32_t img1Cmac[4];        /*!< [0x080-0x08f] */
    uint8_t reserved2[348];      /*!< [0x090-0x1eb] */
    uint32_t cfpaCrc;            /*!< [0x1eb-0x1ef] */
    uint32_t cfpaCmac[4];        /*!< [0x1f0-0x1ff] */
} cfpa_cfg_info_t;

#define FFR_BOOTCFG_USBSPEED_SHIFT (9U)
#define FFR_BOOTCFG_USBSPEED_MASK (0x3u << FFR_BOOTCFG_USBSPEED_SHIFT)
#define FFR_BOOTCFG_USBSPEED_NMPASEL0 (0x0U)
#define FFR_BOOTCFG_USBSPEED_FS (0x1U)
#define FFR_BOOTCFG_USBSPEED_HS (0x2U)
#define FFR_BOOTCFG_USBSPEED_NMPASEL3 (0x3U)

#define FFR_BOOTCFG_BOOTSPEED_MASK (0x18U)
#define FFR_BOOTCFG_BOOTSPEED_SHIFT (7U)
#define FFR_BOOTCFG_BOOTSPEED_NMPASEL (0x0U)
#define FFR_BOOTCFG_BOOTSPEED_48MHZ (0x1U)
#define FFR_BOOTCFG_BOOTSPEED_96MHZ (0x2U)

#define FFR_USBID_VENDORID_MASK (0xFFFFU)
#define FFR_USBID_VENDORID_SHIFT (0U)
#define FFR_USBID_PRODUCTID_MASK (0xFFFF0000U)
#define FFR_USBID_PRODUCTID_SHIFT (16U)

#define FFR_IMAGE0_CMAC_UPDATE_MASK (0x1U)
#define FFR_IMAGE1_CMAC_UPDATE_MASK (0x2U)

typedef struct
{
    uint32_t bootCfg;        /*!< [0x000-0x003] */
    uint32_t spiFlashCanCfg; /*!< [0x004-0x007] */
    struct
    {
        uint16_t vid;
        uint16_t pid;
    } usbId;                     /*!< [0x008-0x00b] */
    uint32_t sdioCfg;            /*!< [0x00c-0x00f] */
    uint32_t dcfgPin;            /*!< [0x010-0x013] */
    uint32_t dcfgDflt;           /*!< [0x014-0x017] */
    uint32_t dapVendorUsage;     /*!< [0x018-0x01b] */
    uint32_t secureBootCfg;      /*!< [0x01c-0x01f] */
    uint32_t princeBaseAddr;     /*!< [0x020-0x023] */
    uint32_t princeSr[3];        /*!< [0x024-0x02f] */
    uint32_t xtal32kCapBankTrim; /*!< [0x030-0x033] */
    uint32_t xtal16mCapBankTrim; /*!< [0x034-0x037] */
    uint32_t flashRemapSize;     /*!< [0x038-0x03b] */
    uint32_t flashRemapOffset;   /*!< [0x03c-0x03f] */
    uint32_t princeXom[3];       /*!< [0x040-0x04b] */
    uint32_t rokthUsage;         /*!< [0x04c-0x04f] */
    uint32_t rotkh[12];          /*!< [0x050-0x07f] */
    uint32_t flexspiCfg0;        /*!< [0x080-0x083] */
    uint32_t flexspiCfg1;        /*!< [0x084-0x087] */
    uint8_t reserved1[8];        /*!< [0x088-0x08f] */
    struct
    {
        uint32_t ipedStartAddr; /*!< [0x090-0x093] */
        uint32_t ipedEndAddr;   /*!< [0x094-0x097] */
    } ipedRegions[4];

    uint8_t reserved2[320]; /*!< [0x0b0-0x1ef] */
    uint32_t cmpaCmac[4];   /*!< [0x1f0-0x1ff] */
} cmpa_cfg_info_t;

typedef struct
{
    uint32_t header;
    uint8_t reserved[4];
} cmpa_key_store_header_t;

